List<String> duaHadithAr = [
  'اللّهُـمَّ صَلِّ عَلـى مُحمَّـد، وَعَلـى آلِ مُحمَّد، كَمـا صَلَّيـتَ عَلـى إبْراهـيمَ وَعَلـى آلِ إبْراهـيم، إِنَّكَ حَمـيدٌ مَجـيد ، اللّهُـمَّ بارِكْ عَلـى مُحمَّـد، وَعَلـى آلِ مُحمَّـد، كَمـا بارِكْتَ عَلـى إبْراهـيمَ وَعَلـى آلِ إبْراهيم، إِنَّكَ حَمـيدٌ مَجـيد',
  'اَللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا , وَلَا يَغْفِرُ اَلذُّنُوبَ إِلَّا أَنْتَ , فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ , وَارْحَمْنِي , إِنَّكَ أَنْتَ اَلْغَفُورُ اَلرَّحِيمُ',
  'اللَّهُمَّ أغِثْنَا، اللَّهُمَّ أغِثْنَا، اللَّهُمَّ أغِثْنَا',
  'اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِن عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ المَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ',
  'للَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّ',
  'اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ',
  'يا رَبِّ، ولَكِنْ لا غِنَى بي عن بَرَكَتِكَ',
  'اللَّهُمَّ أَحْيِنِي مَا كَانَتْ الْحَيَاة خَيْرًا لِي , وَتَوَفَّنِي إِذَا كَانَتْ الْوَفَاة خَيْرًا لِي',
  'اَللَّهُمَّ أَنْتَ رَبِّي, لَا إِلَهَ إِلَّا أَنْتَ, خَلَقْتَنِي, وَأَنَا عَبْدُكَ, وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اِسْتَطَعْتُ, أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ, أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ, وَأَبُوءُ لَكَ بِذَنْبِي, فَاغْفِرْ لِي; فَإِنَّهُ لَا يَغْفِرُ اَلذُّنُوبَ إِلَّا أَنْتَ',
  'اللهم اجعل في قلبي نورا، وفي بَصري نورا، وفي سمعي نورا، وعن يميني نورا، وعن يساري نورا، وفَوْقِي نورا، وتحتي نورا، وأمامي نورا، وخلفي نورا، واجعل لي نورا', //10

  'اَللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا , وَلَا يَغْفِرُ اَلذُّنُوبَ إِلَّا أَنْتَ , فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ , وَارْحَمْنِي , إِنَّكَ أَنْتَ اَلْغَفُورُ اَلرَّحِيمُ',
  'اللّهُـمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَـمِّ وَ الْحُـزْنِ، والعًجْـزِ والكَسَلِ والبُخْـلِ والجُـبْنِ، وضَلْـعِ الـدَّيْنِ وغَلَبَـةِ الرِّجال',
  'اَللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي, وَجَهْلِي, وَإِسْرَافِي فِي أَمْرِي, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّ',
  'اللهمَّ إنِّي أعُوذُ بِكَ مِنْ جَهْدِ البَلاَءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ القَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ',
  'أتُوبُ إلى اللَّهِ ممَّا أذْنَبْتُ',
  'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ وَأَوَّلَهُ وَآخِرَهُ وَعَلاَنِيَتَهُ وَسِرَّهُ',
  'اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ نَقِّنِي مِنْ خَطَايَاىَ كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَاىَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ',
  'اللّهُـمَّ بارِكْ لَهُمْ فيما رَزَقْـتَهُم، وَاغْفِـرْ لَهُـمْ وَارْحَمْهُمْ',
  'اللّهُـمَّ أَطْعِمْ مَن أَطْعَمَني، وَاسْقِ مَن سقاني',
  'اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ', //20

  'اللَّهُمَّ اغْفِرِ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِ',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ',
  'اَللَّهُمَّ أَصْلِحْ لِي دِينِي اَلَّذِي هُوَ عِصْمَةُ أَمْرِي, وَأَصْلِحْ لِي دُنْيَايَ اَلَّتِي فِيهَا مَعَاشِي, وَأَصْلِحْ لِي آخِرَتِي اَلَّتِي إِلَيْهَا مَعَادِي, وَاجْعَلْ اَلْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ, وَاجْعَلْ اَلْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ',
  'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَ',
  'اللْهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ دُعَاءٍ لاَ يُسْمَعُ',
  'اَللَّهُمَّ اِغْفِرْ لِي مَا قَدَّمْتُ, وَمَا أَخَّرْتُ, وَمَا أَسْرَرْتُ, وَمَا أَعْلَنْتُ, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي, أَنْتَ اَلْمُقَدِّمُ وَالْمُؤَخِّرُ, وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَأَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ',
  'اللّهُـمَّ إِنِّـي أَعـوذُ بِرِضـاكَ مِنْ سَخَطِـك ، وَبِمعـافاتِـكَ مِنْ عُقوبَـتِك ، وَأَعـوذُ بِكَ مِنْـك ، لا أُحْصـي ثَنـاءً عَلَـيْك ، أَنْـتَ كَمـا أَثْنَـيْتَ عَلـى نَفْسـِك',
  'اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ', //30

  'أَعـوذُ بِكَلِـماتِ اللّهِ التّـامّاتِ مِنْ شَـرِّ ما خَلَـق',
  'أعوذُ بِاللَّهِ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ',
  'اللَّهُمَّ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ',
  'اللَّهُمَّ أَنْتَ المَلِكُ لا إلَهَ إلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بذَنْبِي، فَاغْفِرْ لي ذُنُوبِي جَمِيعًا، إنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأخْلَاقِ، لا يَهْدِي لأَحْسَنِهَا إلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لا يَصْرِفُ عَنِّي سَيِّئَهَا إلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ في يَدَيْكَ، وَالشَّرُّ ليسَ إلَيْكَ، أَنَا بكَ وإلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إلَيْكَ',
  'اللْهُمَّ رَبَّ السَّموَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ ذِي شَرَ أَنْتَ آخِذٌ بِنَاصِيَتِهِ',
  'اللهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَىْءٌ وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَىْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَىْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَىْءٌ اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ',
  'اللَّهُمَّ لك أَسْلَمْتُ، وبِكَ آمَنتُ، وعَلَيكَ تَوَكَّلْت، وإِلَيكَ أَنَبْتُ، وبك خَاصَمْتُ، اللهم أعُوذ بِعزَّتك؛ لا إله إلا أنت أن تُضلَّني، أنت الحَيُّ الذي لا تموت، والجِنُّ والإنْسُ يَمُوتُونَ',
  'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ',
  'اللَّهُمَّ مُنْزِلَ الكِتَابِ، وَمُجْرِيَ السَّحَابِ، وَهَازِمَ الأَحْزَابِ، اهْزِمْهُمْ وَانْصُرْنَا عَلَيْهِمْ',
  'اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ', //40

  'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
  'اللَّهُمَّ عَافِنِي فِي بَدَنِي ، اللَّهُمَّ عَافِنِي فِي سَمْعِي ، اللَّهُمَّ عَافِنِي فِي بَصَرِي ، لَا إِلَهَ إِلَّا أَنْتَ, اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ ، وَالْفَقْرِ ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ، لَا إِلَهَ إِلَّا أَنْتَ',
  'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي',
  'اللهم إني أعوذ بك من الجوع، فإنه بِئْسَ الضَّجِيعُ،وأعوذُ بِكَ منَ الخِيَانَةِ، فَإنَّهَا بِئْسَتِ البِطَانَةُ',
  'أَعُوذُ بِاللَّهِ الْعَظِيمِ وَبِوَجْهِهِ الْكَرِيمِ وَسُلْطَانِهِ الْقَدِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
  'اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاءُكَ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حُزْنِي ، وذَهَابَ هَمِّي',
  'اللّهُـمَّ رَحْمَتَـكَ أَرْجـو فَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـيْن، وَأَصْلِـحْ لي شَأْنـي كُلَّـه لَا إِلَهَ إِلَّا أنْـت',
  'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ الجَـنَّةَ وأََعوذُ بِـكَ مِـنَ الـنّار',
  'اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ',
  'اَللَّهُمَّ اِغْفِرْ لِي مَا قَدَّمْتُ, وَمَا أَخَّرْتُ, وَمَا أَسْرَرْتُ, وَمَا أَعْلَنْتُ, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي, أَنْتَ اَلْمُقَدِّمُ وَ أَنْتَ الْمُؤَخِّرُ, لَا إلهَ إلَا أنْت', //50

  'اللّهُـمَّ أَعِـنِّي عَلـى ذِكْـرِكَ وَشُكْـرِك ، وَحُسْـنِ عِبـادَتِـك',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ دُعَاءٍ لاَ يُسْمَعُ',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ صَلَاةٍ لَا تَنْفَعُ',
  'اللَّهمَّ إنِّي أعوذُ بكَ مِن شرِّ سَمْعي، ومِن شرِّ بصَري، ومِن شرِّ لساني، ومِن شرِّ قَلْبي، ومِن شرِّ مَنِيِّي',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَدْمِ وَأَعُوذُ بِكَ مِنَ التَّرَدِّي وَأَعُوذُ بِكَ مِنَ الْغَرَقِ وَالْحَرَقِ وَالْهَرَمِ وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا',
  'رَبِّ أعِنِّي ولا تُعِنْ عليَّ، وانصُرْني ولا تنصُرْ عليَّ، وامكُرْ لي ولا تمكُرْ عليَّ، واهْدِني ويَسِّرْ هُدايَ إليَّ، وانصُرْني على من بغى عليَّ',
  'رَبِّ اجعَلْني لك شاكِرًا، لك ذاكِرًا، لك راهِبًا، لك مِطواعًا، إليك مُخبِتًا أو مُنيبًا',
  'رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ قلبي',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئِ الأَسْقَامِ',
  'ربِّ اغفر لي، وتُب عليَّ، إنَّكَ أنتَ التَّوَّابُ الرَّحيمُ', // 60

  'أَعُوذُ بِاَللَّهِ اَلسَّمِيعِ اَلْعَلِيمِ مِنَ اَلشَّيْطَانِ اَلرَّجِيمِ , مِنْ هَمْزِهِ , وَنَفْخِهِ , وَنَفْثِهِ',
  'اَلْحَمْدُ لِلَّهِ رَبِّ اَلْعَالَمِينَ, اَلرَّحْمَنِ اَلرَّحِيمِ, مَالِكِ يَوْمِ اَلدِّينِ, لَا إِلَهَ إِلَّا اَللَّهُ يَفْعَلُ مَا يُرِيدُ, اَللَّهُمَّ أَنْتَ اَللَّهُ, لَا إِلَهَ إِلَّا أَنْتَ, أَنْتَ اَلْغَنِيُّ وَنَحْنُ اَلْفُقَرَاءُ, أَنْزِلْ عَلَيْنَا الْغَيْثَ, وَاجْعَلْ مَا أَنْزَلْتَ قُوَّةً وَبَلَاغًا إِلَى حِينٍ',
  'اللّهمَّ إني أعوذُ بِكَ مَن فِتنة النار ، وعذاب النار ، ومن شر الغنى والفقر',
  'أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه',
  'اللّهُـمَّ إِنا نَجْـعَلُكَ في نُحـورِهِـم، وَنَعـوذُ بِكَ مِنْ شُرورِهـمْ',
  'اللّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ، وَالْقِلَّةِ، وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أو أُظْلَمَ',
  'اللَّهمَّ إنِّي أعوذُ بِك مِن أَن أضِلَّ أو أزِلَّ أو أظلِمَ أو أُظلَمَ أو أجهَلَ أو يُجهَلَ عليَّ',
  'يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ',
  'للّهُـمَّ اهْـدِنـي فـيمَنْ هَـدَيْـت، وَعـافِنـي فـيمَنْ عافَـيْت، وَتَوَلَّـني فـيمَنْ تَوَلَّـيْت، وَبارِكْ لـي فـيما أَعْطَـيْت، وَقِـني شَرَّ ما قَضَـيْت، فَإِنَّـكَ تَقْـضي وَلا يُقْـضى عَلَـيْك ، إِنَّـهُ لا يَـذِلُّ مَنْ والَـيْت',
  'اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ،وَإِذَا أَرَدْتَ بعبادك فِتْنَةَ فاقبِضْني إليك غَيْرَ مَفْتُونٍ', //70

  'اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا وَاجْعَلْهُ الْوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلاَ مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا',
  'اللَّهمَّ إِنِّي أَعُوذُ بِكَ مِن منْكَرَاتِ الأَخلاقِ، والأعْمَالِ والأَهْواءِ',
  'اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا',
  'اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ،أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.',
  'اللهمَّ ! مَتِّعْنِي بِسَمْعِي وبَصَرِي ، واجعلْهُما الوَارِثَ مِنِّي ، وانْصُرْنِي على مَنْ ظَلَمَنِي ، وخُذْ مِنْهُ بِثَأْرِي',
  'سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ',
  'اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلاً',
  'اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ',
  'اللّهُـمَّ بِعِلْـمِكَ الغَـيْبِ وَقُـدْرَتِـكَ عَلـى الْخَلقِ أَحْـيِني ما عَلِـمْتَ الحـياةَ خَـيْراً لـي، وَتَوَفَّـني إِذا عَلِـمْتَ الوَفـاةَ خَـيْراً لـي',
  'أسألُكَ خشيتَكَ في الغيبِ والشَّهادةِ وَكلمةَ الإخلاصِ في الرِّضا والغضبِ وأسألُكَ نعيمًا لاَ ينفدُ وقرَّةَ عينٍ لاَ تنقطعُ', //80

  'أسألُكَ الرِّضاءَ بالقضاءِ وبردَ العيشِ بعدَ الموتِ ولذَّةَ النَّظرِ إلى وجْهِكَ والشَّوقَ إلى لقائِكَ',
  'أعوذُ بِكَ من ضرَّاءٍ مُضرَّةٍ وفتنةٍ مضلَّةٍ اللَّهمَّ زيِّنَّا بزينةِ الإيمانِ واجعَلنا هداةً مُهتدين',
  'اللهُمَّ اهْدِنِي وَسَدِّدْنِي',
  'اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ, عَاجِلِهِ وَآجِلِهِ, مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ, وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ, عَاجِلِهِ وَآجِلِهِ, مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ.',
  'اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ, وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ',
  'اَللَّهُمَّ إِنِّي أَسْأَلُكَ اَلْجَنَّةَ, وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ, وَأَعُوذُ بِكَ مِنَ النَّارِ, وَمَا قَرَّبَ مِنْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ, وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا',
  'اللَّهُمَّ إنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً',
  'اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ',
  'اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ',
  'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ ', //90

  'اَللَّهُمَّ اغْفِرْ لِحَيِّنَا, وَمَيِّتِنَا, وَشَاهِدِنَا, وَغَائِبِنَا, وَصَغِيرِنَا, وَكَبِيرِنَا, وَذَكَرِنَا, وَأُنْثَانَا, اَللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى اَلْإِسْلَامِ, وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى اَلْإِيمَانِ',
  'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي رِزْقِي وَبَارِكْ لِي فِيمَا رَزَقْتَنِ',
  'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لا أَعْلَمُ‏',
  'اللَّهُمَّ احْفَظْنِي بِالْإِسْلَامِ قَائِمًا وَاحْفَظْنِي بِالْإِسْلَامِ قَاعِدًا وَاحْفَظْنِي بِالْإِسْلَامِ رَاقِدًا وَلَا تُشْمِتْ بِي عَدُوًّا وَلا حَاسِدًا، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَدِكَ',
  'اللَّهُمَّ قِنِي شَرَّ نَفْسِي، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي',
  'اللَّهُمَّ إنّي أعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ، وَمِنْ لَيْلَةِ السُّوءِ، وَمِنْ سَاعَةِ السُّوءِ، وَمِنْ صَاحِبِ السُّوءِ، وَمِنْ جَارِ السُّوءِ في دَارِ الْمُقامَةِ',
  'اَللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي, فَحَسِّنْ خُلُقِي',
  'أتُوبُوا إلى اللهِ واسْتَغْفِرُوهُ',
  'اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لاَ قَابِضَ لِمَا بَسَطْتَ، وَلاَ مُقَرِّبَ لِمَا بَاعَدْتَ، وَلاَ مُبَاعِدَ لِمَا قَرَّبْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ مَانِعَ لِمَا أَعْطَيْتَ‏.‏ اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ',
  'اللَّهُمَّ إِنِّي أَسْأَلُكُ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ،', //100

  'اللَّهُمَّ حَبِّبْ إِلَيْنَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ',
  'اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ، غَيْرَ خَزَايَا وَلاَ مَفْتُونِينَ',
  'اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ؛ فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ',
  'اللَّهُمَّ إنِّي أسأَلُك بعِزَّتِك أنْ تُنجِيَني مِن النَّارِ',
  'يا ولِيَّ الإسلامِ وأهلِه ثبِّتْني به حتَّى ألقاكَ', //105
];
