// ignore_for_file: prefer_interpolation_to_compose_strings
class MegbiyaContent {
  // ignore: non_constant_identifier_names
  List<String> megbiya_text = [
    'بسم الله الرحمن الرحيم',
    '   ከ አምስቱ የ እስልምና መሰረቶች ውስጥ 5ኛው እና የመጨረሻው ሃጅ ይካተትበታል። ሃጅ ወደ መካ የሚደረግ የአምልኮ ጉዞ ሲሆን በ አረቦቹ በ ዙል ሂጃ ወር በ ስምንተኛው የሚጀምር '
        'ሲሆን በ 12ኛው ያበቃል ታዲያ ይህ ጉዞ ለሁሉም ሙስሊም በገንዘብም ሆነ በጉልበት አቅሙ እስከቻለ ድረስ በህይወት ዘመኑ ቢያንስ አንድ ግዜ ሃጅ እንዲያደርግ ግዴታ ተደርጓል። በለላኛው '
        'ዑምራ እንደ ሃጅ ወደ መካ የሚደረግ ጉዞ ቢሆንም ነገርግን ግዳጅ አልተደረገም። ዑምራ በማንኛውም ወቅት ልንፈጽመው የምንችላው ተወዳጅ ተግባር ነው።',
    'በመሆኑም እነሱን በማውቅ እንዲሁም ህግጋቱን ጠንቅቆ መስራት ኢባዳዎን የተሟላ እንዲሆን ያደርጋል',
    'የ ሃጅ አይነቶች በሶስት የከፈላሉ ለነሱም የተለያዩ አይነት አፈጻጸም አላቸው',
    'ሃጅ አል-ኢፍራድ ፡ ይህ የ ሃጅ አይነት ሃጅን ብቻ ሲሆን እርድ መፈጸም አይጠበቅቦትም። የዚህን አይነት ሃጅ የሚፈጽም ተጓዥ ሙፍሪድ ይባላል።',
    'ሃጅ አል-ቂራን፡ ይህኛው አፈጻጸም ሃጅን እና ዑምራንበ አንድ ኢህራም እና ኒያ  የሚፈጽሙበት ሁኔታ ሲሆን እርድ ማቅረብ ግዴታ ይሆናል። የዚህን አይነት ሃጅ የሚፈጽም ተጓዥ ቀሪን ይባላል።',
    'ሃጅ አል-ተመቱዕ፡  ይህኛው የሃጅ አይነት ተመራጭ የሆነ ወይም ረሱል ﷺ ሶሃቦቻቸውን እንዲሰሩ ያበረታቱ የነበረው የሃጅ አይነት ሲሆን አፈጻጸሙም የ ሃጅ ወራቶች(ሸዋል፣  ዙልቃዕዳ እና ዙል-ሂጃ) ከገቡ ጀምሮ ሃጅ ከመድረሱ በፊት ዑምራን አስቀድሞ በመፈጸም ድጋሚ የ ሃጅ ውቅት ሲደርስ በሌላ ኢህራም ሃጅን መፈጸም። የዚህን አይነት ሃጅ የሚፈጽም ተጓዥ ሙተመቲዕ ይባላል።',
  ];
  String content =
      'ከ አምስቱ የ እስልምና መሰረቶች ውስጥ 5ኛው እና የመጨረሻው ሃጅ ይካተትበታል። ሃጅ ወደ መካ የሚደረግ የአምልኮ ጉዞ ሲሆን በ አረቦቹ በ ዙል ሂጃ ወር በ ስምንተኛው የሚጀምር ሲሆን በ 12ኛው ያበቃል ታዲያ ይህ ጉዞ ለሁሉም ሙስሊም በገንዘብም ሆነ በጉልበት አቅሙ እስከቻለ ድረስ በህይወት ዘመኑ ቢያንስ አንድ ግዜ ሃጅ እንዲያደርግ ግዴታ ተደርጓል።';
}
