import 'package:azkar_plus/screens/azkar/contents/azkar.dart';

List<Azkar> afterSalahAzkar = [
  Azkar(ar: 'أَسْتَغْفِرُ اللهَ', am: 'የአላህን ማህርታ እጠይቃለሁ', co: 3),
  Azkar(
      ar: 'اَللّٰهُمَّ أَنْتَ السَّلَامُ ، وَمِنْكَ السَّلَامُ ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ',
      am: 'አላህ ሆይ! አንተ ሰላም ነህ፣ ሰላም ከአንተ ነው፣ የግራማና የክብር ባለቤት አንተ የተባረክ ነህ።',
      co: 1),
  Azkar(
      ar: 'لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ ، اَللّٰهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَـدِّ مِنْكَ الْجَـدُّ',
      am: 'ከአላህ በቀር በቀር አምላክ የለም፣ በቻውን የሆነ፣ ለእርሱም አጋር የሌለው፣ግዛት ሁሉ የእርሱ ነው እንዲሁም መስጋናም ሁሉ፣ እርሱ በሁሉ ነገር ላይ ቻይ ነው። አላህ ሆይ! አንተ የሰጠኸውን የሚነሳ የለም፣ የነሳሃውን የሚሰጥ የለም፣ እና የባለጸጎች ሃብት በአንተ ላይ አይጠቅማቸውም።',
      co: 1),
  Azkar(
      ar: 'لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ ، لَا إِلٰهَ إِلَّا اللهُ ، وَلَا نَعْبُدُ إِلَّا إيَّاهُ ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ ، لَا إِلٰهَ إِلَّا اللهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ ، وَلَوْ كَرِهَ الْكَافِرُوْنَ',
      am: 'ከአላህ በቀር በቀር አምላክ የለም፣ በቻውን የሆነ፣ ለእርሱም አጋር የሌለው፣ግዛት ሁሉ የእርሱ ነው እንዲሁም መስጋናም ሁሉ፣ እርሱ በሁሉ ነገር ላይ ቻይ ነው። ሃይልም ጥንካሬም በአላህ ቢሆን እንጂ የለም፣ ከአላህ በቀር አምላክ የለም፣ ከእርሱ በቀር አንገዛም፣ ጸጋ ሞገስ እንዲሁም መልካም ውዳሴ ለእርሱ የተገባ ነው፣ ከእርሱ በቀር አምላክ የለም ህይማኖታችንን ለእርሱ አጥርተን እንከተላለን፣ ከሃዲያን ቢጠሉም እንኳ።',
      co: 1),
  Azkar(
      ar: 'سُبْحَانَ اللهِ, اَلْحَمْدُ للهِ,اَللهُ أَكْبَرُ',
      am: 'አልህ ጥራት ይገባው፣ ምስጋና ለአላህ የተገባ ነው፣ አላህ ታላቅ ነው።',
      co: 33),
  Azkar(
      ar: 'لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ',
      am: 'ከአላህ በቀር በቀር አምላክ የለም፣ በቻውን የሆነ፣ ለእርሱም አጋር የሌለው፣ግዛት ሁሉ የእርሱ ነው እንዲሁም መስጋናም ሁሉ፣ እርሱ በሁሉ ነገር ላይ ቻይ ነው።',
      co: 1),
  Azkar(
      ar: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ'
          '\n'
          'قُلْ هُوَ اللهُ أَحَدٌ ، اَللهُ الصَّمَدُ ، لَمْ يَلِدْ وَلَمْ يُوْلَدْ ، وَلَمْ يَكُنْ لَّهُ كُفُوًا أَحَدٌ'
          '\n(ከመግሪብ እና ከፈጅር ሶላት በኋላ 3 ጊዜ)',
      am: 'በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።\n'
          '(1)	በል <<እርሱ አላህ አንድ ነው። (2) << አላህ (የሁሉ) መጠጊያ ነው። (3) << አልወለደም፣ አልተወለደም። (4) << ለእርሱም አንድም ብጤ የለውም።>>',
      co: 1),
  Azkar(
      ar: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ'
          '\n'
          'قُلْ أَعُوْذُ بِرَبِّ الْفَلَقِ ، مِنْ شَرِّ مَا خَلَقَ ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ'
          '\n(ከመግሪብ እና ከፈጅር ሶላት በኋላ 3 ጊዜ)',
      am: 'በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።\n'
          'በል << በተፈልቃቂው ጎህ ጌታ እጠበቃለሁ። (2) << ከፈጠረው ፍጡር ሁሉ ክፋት። (3) << ከሌሊትም ክፋት ባጨለመ ጊዜ፡ (4) << በተቋጠሩ (ክሮች) ላይ ተፊዎች ክኾኑት (ደጋሚ) ሴቶችም ክፋት። (5) << ከምቀኛም ክፋት በተመቀኘ ጊዜ፤ (እጠበቃለሁ በል)። >>',
      co: 1),
  Azkar(
      ar: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ'
          '\n'
          'قُلْ أَعُوْذُ بِرَبِّ النَّاسِ ، مَلِكِ النَّاسِ ، إِلٰهِ النَّاسِ ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ، اَلَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ ، مِنَ الْجِنَّةِ وَالنَّاسِ'
          '\n(ከመግሪብ እና ከፈጅር ሶላት በኋላ 3 ጊዜ)',
      am: 'በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።\n'
          '(1)	በል << በሰዎች ፈጣሪ እጠበቃለሁ። (2) <<የሰዎች ሁሉ ንጉስ በኾነው። (3) <<የሰዎች አምላክ በኾነው። (4) << በቅ እልም ባይ ከኾነው ጎትጓች (ሰይጣን) ክፋት። (5) << ከዚያ በሰዎች ልቦች ውስጥ የሚጎተጉት ከኾነው። (6) << ከጋኔኖችም ከሰዎችም (ሰይጣናት እጠበቃለሁ በል)። >>',
      co: 1),
  Azkar(
      ar: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ'
          '\n'
          'اَللهُ لَا إِلٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ، لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ، لَهُ مَا فِي السَّمٰوَاتِ وَمَا فِي الْأَرْضِ ، مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ، يَعْلَمُ مَا بَيْنَ أَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ، وَسِعَ كُرْسِيُّهُ السَّمٰوَاتِ وَالْأَرْضَ وَلَا يَئُوْدُهُُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيْمُ',
      am: 'በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።\n'
          'አላህ ከእርሱ በቀር ሌላ አምላክ የለም። ህያው ራሱን ቻይ ነው። ማንገላጀትም እንቅልፍም አትይዘውም። በሰማያት ውስጥና በምድር ውስጥ ያለው ሁሉ የርሱ ብቻ ነው። የ እርሱ በፈቃዱ ቢሆን እንጂ የሚያማልድ ማነው? (ከፍጡሮቹ) በፊታቸው ያለውንና ከኋላቸው ያለውን ሁሉ ያውቃል። በሻውም ጊዜ እንጂ ከዕውቀቱ በምንም ነገረ እያካብቡም (አያውቁም)። መንበሩ ሰማያትንና ምድርን ሰፋ። ጥበቃቸውም አያቅተውም። እርሱም የሁሉ በላይ ታላቅ ነው።',
      co: 1),
  Azkar(
      ar: 'لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِيْ وَيُمِيْتُ ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ'
          '\n(ከመግሪብ እና ከፈጅር ሶላት በኋላ 10 ጊዜ)',
      am: 'ከአላህ በቀር በቀር አምላክ የለም፣ በቻውን የሆነ፣ ለእርሱም አጋር የሌለው፣ ግዛት ሁሉ የእርሱ ነው እንዲሁም መስጋናም ሁሉ፣ ህያው የሚያደርግም የሚገድልም እርሱ ነው፣ እርሱ በሁሉ ነገር ላይ ቻይ ነው።',
      co: 1),
  Azkar(
      ar: 'اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا ، وَرِزْقًا طَيِّبًا ، وَعَمَلًا مُتَقَبَّلًا'
          '(የፈጅር ሶላት ከጨረሱ በኋላ)',
      am: 'አላህ ሆይ! የሚጠቅም እውቅትን ጥሩ መተዳደሪያንም፣ ተቀባይነት ያለውንም ተግባር እንድትሰጠኝ እጠይቃለሁ',
      co: 1),
];
