import 'package:azkar_plus/screens/azkar/contents/azkar.dart';

List<Azkar> eveningAzkar = [
  Azkar(
    ar: 'الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ',
    am: 'ምስጋና ለአላህ ብቻ የተገባ ይሁን፣ እዝነት እና ሰላአም ከእርሶ በኋላ ሌላ ነብይ ለማይመጣው (በሙሃመድ) ላይ ይሁን',
    co: 1,
  ),
  Azkar(
      ar: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ \nٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌۭ وَلَا نَوْمٌۭ ۚ لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍۢ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ',
      am: 'በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው። \nአላህ ከእርሱ በቀር ሌላ አምላክ የለም። ህያው ራሱን ቻይ ነው። ማንገላጀትም እንቅልፍም አትይዘውም። በሰማያት ውስጥና በምድር ውስጥ ያለው ሁሉ የርሱ ብቻ ነው። የ እርሱ በፈቃዱ ቢሆን እንጂ የሚያማልድ ማነው? (ከፍጡሮቹ) በፊታቸው ያለውንና ከኋላቸው ያለውን ሁሉ ያውቃል። በሻውም ጊዜ እንጂ ከዕውቀቱ በምንም ነገረ እያካብቡም (አያውቁም)። መንበሩ ሰማያትንና ምድርን ሰፋ። ጥበቃቸውም አያቅተውም። እርሱም የሁሉ በላይ ታላቅ ነው።',
      co: 1),
  Azkar(
      ar: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ '
          '\nقُلْ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمْ يَلِدْ وَلَمْ يُولَدْ (٣) وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (٤) ',
      am: 'በአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።'
          '\n(1)	በል <<እርሱ አላህ አንድ ነው። (2) << አላህ (የሁሉ) መጠጊያ ነው። (3) << አልወለደም፣ አልተወለደም። (4) << ለእርሱም አንድም ብጤ የለውም።>>',
      co: 3),
  Azkar(
      ar: '\nبِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ '
          '\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلْعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥) ',
      am: '\nበአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።'
          '\n(1)	በል << በተፈልቃቂው ጎህ ጌታ እጠበቃለሁ። (2) << ከፈጠረው ፍጡር ሁሉ ክፋት። (3) << ከሌሊትም ክፋት ባጨለመ ጊዜ፡ (4) << በተቋጠሩ (ክሮች) ላይ ተፊዎች ክኾኑት (ደጋሚ) ሴቶችም ክፋት። (5) << ከምቀኛም ክፋት በተመቀኘ ጊዜ፤ (እጠበቃለሁ በል)። >>',
      co: 3),
  Azkar(
      ar: '\nبِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ '
          '\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (٤) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (٦)',
      am: '\nበአላህ ስም እጅግ በጣም ሩህሩህ በጣም አዛኝ በኾነው።'
          '\n(1)	በል << በሰዎች ፈጣሪ እጠበቃለሁ። (2) <<የሰዎች ሁሉ ንጉስ በኾነው። (3) <<የሰዎች አምላክ በኾነው። (4) << በቅ እልም ባይ ከኾነው ጎትጓች (ሰይጣን) ክፋት። (5) << ከዚያ በሰዎች ልቦች ውስጥ የሚጎተጉት ከኾነው። (6) << ከጋኔኖችም ከሰዎችም (ሰይጣናት እጠበቃለሁ በል)። >>',
      co: 3),
  Azkar(
      ar: 'اَمْسَيْنَا وَاَمْسَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا اللَّيْلَةِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ',
      am: 'እነሆ አመሸን እናም ንግስናም ሁሉ የአላህ ብቻ ነው፣ ምስጋናም ለአላህ ይገባው፣ ከአላህ በቀርም የሚመለክ የለም፣ እርሱ ብቻ ለእርሱም አጋር የለውም፣ ንግስና እና ምስጋና ሁሉ ለእርሱ የተገባ ነው እርሱም በነገራቶች ሁሉ ላይ ቻይ ነው፣ ጌታዬ ከዚህች ምሽት መልካም ነገርን እጠይቃሃለሁ፣ ከእርሷም በኋላ መልካም ነገርን (እጠይቃሃለሁ)፣ ከዚህች ምሽት ክፉ ነገራቶች በአንተ እጠበቃለሁ፣ ከእርሷም በኋላ ከክፉ ነገራቶች (በአንተ እጠበቃለሁ)፣ ጌታዬ ከስንፍና እና ከመጠፎ እርጅና በአንተ እጠበቃለሁ፣ ጌታዬ ከእሳት ቅጣት እና ከቀብር ቅጣት በአንተ እጠበቃለሁ።',
      co: 1),
  Azkar(
      ar: 'اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَـيْكَ المَصِيْر.',
      am: 'አላህ ሆይ! በአንተ ፈቃድ አነጋን በአንተ ፈቃድም አመሸን፣ በአንተ ፈቃድም እንኖራለን፣ በአንተ ፈቃድም እንሞታለን መመለሻችንም ወዳንተ ነው።',
      co: 1),
  Azkar(
      ar: 'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ  عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
      am: 'አላህ ሆይ! አንተ ጌታዬ ነህ ከአንተ በቀር የሚመለክ የለም፣ ፈጠርከኝ እኔም ባሪያህ ነኝ፣ እኔም እስከቻልኩት በቃልህ እና በቃልኪዳንህ ነኝ፣ ከፈጽምኩት ክፋት በአንተ እጠበቃለህ፣ በእኔም ላይ ጸጋህን እመሰክራለሁ፣ ሃጢያቴንም እመሰክራለሁ ማረኝ እነሆ ከአንተ በቀር ሃጢያትን የሚምር የለምና። ',
      co: 1),
  Azkar(
      ar: 'اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ',
      am: 'አላህ ሆይ! እኔ አመሸሁኝ እናም አንተንና የዙፋንህን ተሸካሚዎች፣ መላእኮችህንም ፍጥረታቶችህን በመላ አንተ አላህ መሆንህን ከአንተ በቀር የሚመለክ አለመኖሩን አንተን ብቻ እንጂ አጋር ሳይኖርህ ሙሃመድም ባርያህ እና መላዕክተኛህ መሆኑን እንዲመሰክሩ እጣራለሁ።',
      co: 4),
  Azkar(
      ar: 'اللَّهُمَّ مَا أَمْسَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ',
      am: 'አላህ ሆይ! በእኔ ላይ ወይም ከፍጥረታቶችህ ባአንዱ ያመሸ ጸጋ ሁሉ ከአንተ ብቻ ነው አጋር የሌለህ ነህ፣(ምስጋና ሁሉ ላንተ የተገባ ነው)',
      co: 1),
  Azkar(
      ar: 'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ  عافِـني في  بَصَـري ، لا إلهَ إلاّ اللّه أَنْـتَ',
      am: 'አላህ ሆይ! ሰውነቴን ጤናማ አርግልኝ፣ አላህ ሆይ! መስሚያዬን  ጤናማ አርግልኝ፣ አላህ ሆይ! እይታዬን ጤናማ አርግልኝ፣ ከአንተ በቀር የሚመለክ የለም። አላህ ሆይ! እኔ ከክህደት እና ከድህነት በአንተ እጠበቃለሁ፣ እንዲሁም ከቀብር ቅጣት በአንተ እጠበቃለሁ፣ ከአንተ በቀር የሚመለክ የለም',
      co: 3),
  Azkar(
      ar: 'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
      am: 'አላህ በቂዬ ነው ከእርሱ በቀር የሚመለክ የለም በእርሱ እተማመናለሁ እርሱ የታላቁ አርሽ ጌታ ነው።',
      co: 7),
  Azkar(
      ar: 'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ  وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي .',
      am: 'አላህ ሆይ! እኔ በምድራዊ አለም እና በመጨረሻይቱ ይቅርታን እና ጤናን (እንድትሰጠኝ) እጠይቃለሁ፣ አላህ ሆይ! እኔ በሃይማኖቴ፣ በምድራዊ አለሜ፣ በቤተሰቤ እና በገንዘቤ(በሃብቴ) ይቅርታን እና ጤናን (እንድትሰጠኝ) እጠይቃለሁ። አላህ ሆይ! ሃፍረተ ገላዬን ሸፍንልኝ ፍርሃቴንም ጠብቀኝ፣ አላህ ሆይ! ከፊቴም፣ ከኋላዬም፣ ከቀኜም፣ ከግራዬም፣ ከበላዬ እና ከበታቼም ጠብቀኝ፣ ከበታቼ ከመገደልም በታላቅነትህ እጠበቃለሁ።',
      co: 1),
  Azkar(
      ar: 'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ   نَفْسـي  وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى  نَفْسـي  سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم .',
      am: 'አልሃ ሆይ! የማይታየውን እና የሚታየውን አዋቂው የሰማያት እና የምድር ፈጣሪ፣ የሁሉ ነገር ጌታ እና ገዢ፣ ከአንተ በቀር ሊመለክ የሚገባ አለምኖሩን እመሰክራለሁ፣ ከራሴ ክፋት በአንተ እጠበቃለሁ፣ እንዲሁም ከሰይጣን ክፋት እና (በአንተ ላይ) ከማጋራት፣ በራሴ ላይ ስህተት ከመፈጽምም ወይም በሌላ ሙስሊም ላይ ከማምጣት (በአንተ እጠበቃለሁ)',
      co: 1),
  Azkar(
      ar: 'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم',
      am: 'በአላህ ሰም በዚያ በስሙ ከምድርም ከሰማይም ካለ ነገር ከጉዳታቸው የሚጠብቅ በሆነው፣ እሱ ሁሉን ሰሚው እና ሁሉን አዋቂው ነው',
      co: 3),
  Azkar(
      ar: 'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ نَبِيّـاً',
      am: 'የአላህን ጌትነት ወደድኩ፣ የኢስላምንም ሃይማኖትነት(ወደድኩ)፣ የአላህ እዝነት እና በረከት በርሳቸው ላይ ይሁንና የሙሃመድንም ነብይነት (ወደድኩ)',
      co: 3),
  Azkar(
      ar: 'يا حَـيُّ يا قَيّـومُ بِـرَحْمَـتِكِ أَسْتَـغـيث ، أَصْلِـحْ لي شَـأْنـي كُلَّـه ، وَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـين .',
      am: 'ዘልዐለማዊ ህያው ሆይ! እራሱን ቻይ እና የሁሉ ደጋፊ ሆይ! በምህረትህ እርዳታ እሻለሁ፣ ጉዳዬቼን ሁሉ አስተካክልልኝ፣ ለአይን ጥቅሻም(አፍታም ቢሆን) ለእራሴ አትተውኝ',
      co: 1),
  Azkar(
      ar: 'أَمْسَيْـنا وَأَمْسـى المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذهِ اللَّـيْلَة ، فَتْحَهـا ، وَنَصْـرَهـا ، وَنـورَهـا وَبَـرَكَتَـهـا ، وَهُـداهـا ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهـاِ وَشَـرِّ ما بَعْـدَهـا ',
      am: 'እነሆ አመሸን ንግስና ሁሉ ለአላህ የዓለማት ጌታ ለሆነው የተገባ ነው፣ አላህ ሆይ! የዚህችን ምሽት መልካም ነገሯን፣ አሸናፊነቷን፣ ድሏን፣ ብርሃኗን፣ በረከቷን እና እግዣዋን (እንድትሰጠኝ) እጠይቃሃለሁ፣ በእርሷ(በዚህች ለሊት) እና ከእርሷ በኋላም ካለው ክፋት በአንተ እጠበቃለሁ።',
      co: 1),
  Azkar(
      ar: 'أَمْسَيْـنا علـى فِطْـرَةِ الإسْلام ، وَعَلـى كَلِـمَةِ الإخْـلاص ، وَعلـى دينِ نَبِـيِّنا مُحَـمَّدٍ وَعَاـى مِلَّـةِ أبينـا إِبْـراهيـمَ حَنيـفاً مُسْلِـماً وَمـا كـانَ مِنَ المُشـرِكيـن',
      am: 'በተፈጥሮው ሃይማኖት ኢስላም ላይ(ሳለን) አመሸን፣ በቅን ንግግርም ላይ፣ በነብያችን ሙሃመድ ሃይማኖትም ላይ፣ በአባታችን ኢብራሂም መንገድም ላይ እርሱም ትክክለኝ ሙስሊም ነበረ ከአጋሪዎችም አልነበረም',
      co: 1),
  Azkar(
      ar: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ',
      am: 'ጥራት እና ምስጋን ለአላህ ይገባው',
      co: 100),
  Azkar(
      ar: 'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شَـريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْـد، وهُوَ على كُلّ شَيءٍ قَدير',
      am: 'ከአላህ በቀር ሊመለክ የሚገባ የለም ብቻውን አጋር የሌለው ሲሆን፣ ንግስና ሁሉ እና ምስጋና ለርሱ ይገባው፣ እርሱም በነገራቶች ሁሉ ላይ ቻይ ነው',
      co: 10),
  Azkar(
      ar: 'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ',
      am: 'ወደ አላህ ይቅርታን እጠይቃለሁ ወደ እርሱም ንሳሃ እመለሳለሁ።',
      co: 100),
  Azkar(
      ar: 'أَعـوذُبِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق',
      am: 'በ አላህ ፍጹም በሆኑ ቃላቶች ከፈጠራቸው ክፉ ነገራቶች ሁሉ እጠበቃለሁ',
      co: 3),
  Azkar(
      ar: 'اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ',
      am: ' አላህ ሆይ! እዝነትህን እና በረከትህን በነብያችን ሙሃምድ ላይ አርግ',
      co: 10)
];
